.planning/case_profiles/case_006_v64_thermo_fpe_fix_dicts/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| 0/T — case_006 ONERA M6 v64-val-full-2.
| T_inf = 288 K. Wing adiabatic (zeroGradient).
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; location "0"; object T; }

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 288.0;

boundaryField
{
    "(farfield_upstream|farfield_downstream|farfield_top|farfield_bottom|farfield_outboard)"
    {
        type            freestream;
        freestreamValue uniform 288.0;
        value           uniform 288.0;
    }
    "(wing_surface_reference|tip_cap|root_fairing_pad|root_fairing_cover|tip_cap_sliver)"
    {
        type            zeroGradient;
    }
    symmetry_plane_root
    {
        type            symmetry;
    }
}
