.planning/case_profiles/case_006_v64_thermo_fpe_fix_dicts/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| 0/alphat — case_006 ONERA M6 v64-val-full-2.
| alphat = mut / Pr_t, mut = rho * nut = 1.133 * 0.01224 ≈ 0.01387
| Pr_t = 0.85 -> alphat_inf ≈ 0.01632 kg/(m s)
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; location "0"; object alphat; }

dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0.01632;

boundaryField
{
    "(farfield_upstream|farfield_downstream|farfield_top|farfield_bottom|farfield_outboard)"
    {
        type            calculated;
        value           uniform 0.01632;
    }
    "(wing_surface_reference|tip_cap|root_fairing_pad|root_fairing_cover|tip_cap_sliver)"
    {
        type            compressible::alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0.01632;
    }
    symmetry_plane_root
    {
        type            symmetry;
    }
}
