.planning/case_profiles/case_006_v64_thermo_fpe_fix_dicts/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| turbulenceProperties — case_006 v64-val-full-2: kOmegaSST RAS.
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; location "constant"; object turbulenceProperties; }

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}
