.planning/case_profiles/case_006_v64_thermo_fpe_fix_dicts/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| fvSolution — case_006 v3 thermo-FPE fix (rhoSimpleFoam steady transonic).     |
|                                                                               |
| v3 changes vs B59 attempt 3:                                                  |
|   1. Added potentialFlow block (potentialFoam pre-step generates smooth      |
|      incompressible velocity field → much better SIMPLE startup than         |
|      uniform freestream IC · canonical mitigation per F-NEW-5 root cause)    |
|   2. URF kept at attempt-3 levels (p=0.10/U=0.30/e=0.10/rho=0.05) — most     |
|      relaxed from B59                                                         |
|   3. PBiCGStab DILU for p (attempt-2/3) instead of GAMG (attempt-1 crashed)  |
|   4. SIMPLE rhoMin/rhoMax/pMin/pMax limiters retained                         |
|   5. residualControl unchanged: continuity 1e-5, momentum/energy 1e-4         |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    "(p|rho)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.05;
    }

    "(U|h|e|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }

    // v3 potentialFoam pre-step: incompressible potential flow as IC.
    Phi
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 5;
    PhiRefCell               0;
    PhiRefValue              0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent          no;
    transonic           yes;
    rhoMin              0.1;
    rhoMax              3.0;
    pMin                30000.0;
    pMax                300000.0;

    residualControl
    {
        p               1e-5;
        U               1e-4;
        h               1e-4;
        e               1e-4;
        "(k|omega)"     1e-4;
    }
}

relaxationFactors
{
    fields
    {
        p               0.10;
        rho             0.05;
    }
    equations
    {
        U               0.30;
        h               0.10;
        e               0.10;
        k               0.30;
        omega           0.30;
    }
}
// ************************************************************************* //
